tap "adoptopenjdk/openjdk"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Modern replacement for 'ls'
brew "exa"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# View, create, manipulate, print and manage files in Portable Document Format
cask "adobe-acrobat-pro"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Tools for building Android applications
cask "android-studio"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Database administration and development tool for PostgreSQL
cask "navicat-for-postgresql"
# App to write, plan, collaborate, and get organized
cask "notion"
# IDE for professional Python development
cask "pycharm"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
# OpenJDK distribution from Azul
cask "zulu11"
mas "BetterSnapTool", id: 417375580
mas "Fantastical", id: 975937182
mas "Free Ruler", id: 1483172210
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
